{
  "users": [
    {
      "id": 1,
      "name": "Admin Principal",
      "email": "admin@cifratech.com",
      "password": "admin123",
      "role": "admin",
      "createdAt": "2024-01-15T10:00:00Z"
    },
    {
      "id": 2,
      "name": "María González",
      "email": "soporte@cifratech.com",
      "password": "soporte123",
      "role": "support",
      "createdAt": "2024-01-20T09:30:00Z"
    },
    {
      "id": 3,
      "name": "Juan Pérez",
      "email": "cliente@example.com",
      "password": "cliente123",
      "role": "client",
      "createdAt": "2024-02-01T14:20:00Z"
    },
    {
      "id": 4,
      "name": "Ana Martínez",
      "email": "ana.martinez@empresa.com",
      "password": "cliente123",
      "role": "client",
      "createdAt": "2024-02-05T11:15:00Z"
    },
    {
      "id": 5,
      "name": "Carlos Rodríguez",
      "email": "carlos.rodriguez@startup.io",
      "password": "cliente123",
      "role": "client",
      "createdAt": "2024-02-10T16:45:00Z"
    }
  ],
  "tickets": [
    {
      "id": 1,
      "title": "No puedo iniciar sesión en mi cuenta",
      "description": "He intentado iniciar sesión múltiples veces pero me aparece un error de credenciales incorrectas. He verificado que el email y contraseña son correctos. Esto comenzó ayer por la tarde.",
      "userId": 3,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "alta",
      "date": "2024-03-15T08:30:00Z",
      "updatedAt": "2024-03-15T10:15:00Z",
      "response": "Hemos verificado tu cuenta y parece que hubo un bloqueo temporal por intentos fallidos. Hemos reiniciado tu sesión. Por favor, intenta nuevamente con tu contraseña actual. Si el problema persiste, contacta nuevamente.",
      "category": "autenticacion"
    },
    {
      "id": 2,
      "title": "Error al procesar pago con tarjeta",
      "description": "Cuando intento realizar un pago con mi tarjeta de crédito, el sistema me muestra un error genérico 'Transacción fallida' sin más detalles. He verificado que la tarjeta tiene fondos y está activa.",
      "userId": 3,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "alta",
      "date": "2024-03-18T14:20:00Z",
      "updatedAt": "2024-03-25T12:00:00Z",
      "response": "",
      "category": "pagos"
    },
    {
      "id": 3,
      "title": "Consulta sobre facturación del mes pasado",
      "description": "Necesito una copia de la factura del mes de febrero. No la recibí por correo y necesito presentarla para contabilidad. ¿Pueden enviármela nuevamente?",
      "userId": 4,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "media",
      "date": "2024-03-10T09:15:00Z",
      "updatedAt": "2024-03-10T11:30:00Z",
      "response": "Hemos enviado la factura de febrero a tu correo electrónico registrado (ana.martinez@empresa.com). Si no la recibes en las próximas 24 horas, por favor verifica tu carpeta de spam o contáctanos nuevamente.",
      "category": "facturacion"
    },
    {
      "id": 4,
      "title": "La aplicación se cierra inesperadamente",
      "description": "Desde la última actualización, la aplicación móvil se cierra sin previo aviso cuando estoy navegando por el dashboard. Esto ocurre aproximadamente cada 10-15 minutos de uso continuo.",
      "userId": 5,
      "assignedTo": null,
      "status": "pendiente",
      "priority": "alta",
      "date": "2024-03-20T16:45:00Z",
      "updatedAt": "2024-03-20T16:45:00Z",
      "response": "",
      "category": "tecnico"
    },
    {
      "id": 5,
      "title": "No puedo cambiar mi contraseña",
      "description": "He intentado cambiar mi contraseña desde la sección de configuración pero después de completar el formulario, no recibo el correo de confirmación. He esperado más de una hora.",
      "userId": 3,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "media",
      "date": "2024-03-19T10:00:00Z",
      "updatedAt": "2024-03-19T13:20:00Z",
      "response": "Estamos investigando el problema con el sistema de envío de correos. Mientras tanto, hemos restablecido tu contraseña manualmente. Revisa tu bandeja de entrada (y spam) para el correo con las nuevas credenciales temporales.",
      "category": "autenticacion"
    },
    {
      "id": 6,
      "title": "Duda sobre el plan de suscripción",
      "description": "Quisiera saber qué diferencias hay entre el plan básico y el plan premium. También me gustaría saber si puedo cambiar de plan en cualquier momento.",
      "userId": 4,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "baja",
      "date": "2024-03-12T11:30:00Z",
      "updatedAt": "2024-03-12T14:00:00Z",
      "response": "El plan básico incluye hasta 5 usuarios y 10GB de almacenamiento, mientras que el plan premium permite usuarios ilimitados y 100GB. Puedes cambiar de plan en cualquier momento desde tu panel de configuración, y el cambio se aplicará en el próximo ciclo de facturación. Te hemos enviado un documento comparativo detallado a tu correo.",
      "category": "consultas"
    },
    {
      "id": 7,
      "title": "Error 500 al generar reporte",
      "description": "Cada vez que intento generar un reporte mensual, aparece un error 500 en la pantalla. Esto comenzó hace 3 días. Antes funcionaba correctamente.",
      "userId": 5,
      "assignedTo": null,
      "status": "pendiente",
      "priority": "alta",
      "date": "2024-03-21T09:00:00Z",
      "updatedAt": "2024-03-21T09:00:00Z",
      "response": "",
      "category": "tecnico"
    },
    {
      "id": 8,
      "title": "Solicitud de integración con API externa",
      "description": "Necesito integrar nuestro sistema con una API de terceros para sincronizar datos. ¿Ofrecen soporte para este tipo de integraciones? ¿Cuál es el proceso?",
      "userId": 4,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "media",
      "date": "2024-03-17T13:45:00Z",
      "updatedAt": "2024-03-18T10:20:00Z",
      "response": "Sí, ofrecemos soporte para integraciones con APIs externas. Nuestro equipo técnico está revisando tu solicitud y se pondrá en contacto contigo en las próximas 48 horas para coordinar los detalles técnicos y el cronograma de implementación.",
      "category": "consultas"
    },
    {
      "id": 9,
      "title": "Los datos no se están sincronizando",
      "description": "He notado que los cambios que hago en la aplicación web no se reflejan en la aplicación móvil. La última sincronización exitosa fue hace aproximadamente 6 horas.",
      "userId": 3,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "media",
      "date": "2024-03-14T15:20:00Z",
      "updatedAt": "2024-03-14T17:45:00Z",
      "response": "El problema se debía a un servicio de sincronización que estaba temporalmente fuera de línea. Hemos reiniciado el servicio y forzado una sincronización completa. Tus datos ahora deberían estar actualizados en ambas plataformas. Si notas alguna inconsistencia, por favor recarga la aplicación móvil.",
      "category": "tecnico"
    },
    {
      "id": 10,
      "title": "Pregunta sobre política de reembolsos",
      "description": "Cancelé mi suscripción hace una semana pero aún no he recibido el reembolso. ¿Cuánto tiempo tarda normalmente este proceso?",
      "userId": 5,
      "assignedTo": null,
      "status": "pendiente",
      "priority": "media",
      "date": "2024-03-22T10:15:00Z",
      "updatedAt": "2024-03-22T10:15:00Z",
      "response": "",
      "category": "facturacion"
    },
    {
      "id": 11,
      "title": "No puedo subir archivos mayores a 5MB",
      "description": "El sistema me indica que no puedo subir archivos mayores a 5MB, pero según mi plan debería poder subir hasta 50MB. ¿Hay alguna configuración que deba cambiar?",
      "userId": 4,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "baja",
      "date": "2024-03-16T12:00:00Z",
      "updatedAt": "2024-03-17T09:30:00Z",
      "response": "Hemos verificado tu cuenta y el límite está configurado correctamente en 50MB. El problema parece ser temporal relacionado con la validación del frontend. Estamos trabajando en una corrección. Mientras tanto, intenta subir el archivo nuevamente o divídelo en partes más pequeñas si es urgente.",
      "category": "tecnico"
    },
    {
      "id": 12,
      "title": "Solicitud de exportación de datos",
      "description": "Necesito exportar todos mis datos en formato CSV para realizar un análisis externo. ¿Cómo puedo hacerlo?",
      "userId": 3,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "baja",
      "date": "2024-03-11T08:45:00Z",
      "updatedAt": "2024-03-11T10:00:00Z",
      "response": "Puedes exportar tus datos desde la sección 'Configuración' > 'Exportar datos'. Selecciona el formato CSV y el rango de fechas que necesites. El archivo se generará y estará disponible para descarga en unos minutos. Si necesitas ayuda con el proceso, podemos guiarte paso a paso.",
      "category": "consultas"
    },
    {
      "id": 13,
      "title": "Error de conexión intermitente",
      "description": "Durante las últimas 2 semanas he experimentado desconexiones intermitentes. La aplicación se desconecta por 30-60 segundos y luego se reconecta automáticamente. Esto ocurre varias veces al día.",
      "userId": 5,
      "assignedTo": null,
      "status": "pendiente",
      "priority": "alta",
      "date": "2024-03-23T14:30:00Z",
      "updatedAt": "2024-03-23T14:30:00Z",
      "response": "",
      "category": "tecnico"
    },
    {
      "id": 14,
      "title": "Actualización de información de facturación",
      "description": "Necesito actualizar la dirección de facturación y el método de pago. He intentado hacerlo desde mi perfil pero los cambios no se guardan.",
      "userId": 4,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "media",
      "date": "2024-03-13T16:00:00Z",
      "updatedAt": "2024-03-13T18:20:00Z",
      "response": "Hemos identificado y corregido un bug en el formulario de actualización de datos de facturación. Tu información ha sido actualizada manualmente. Por favor, intenta hacer cambios nuevamente desde tu perfil para confirmar que todo funciona correctamente. Si el problema persiste, avísanos inmediatamente.",
      "category": "facturacion"
    },
    {
      "id": 15,
      "title": "Solicitud de capacitación para el equipo",
      "description": "Somos un equipo de 8 personas que acaba de adoptar la plataforma. ¿Ofrecen sesiones de capacitación o tienen material de entrenamiento disponible?",
      "userId": 3,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "baja",
      "date": "2024-03-19T11:00:00Z",
      "updatedAt": "2024-03-20T09:15:00Z",
      "response": "Sí, ofrecemos sesiones de capacitación personalizadas para equipos. Hemos programado una sesión virtual para tu equipo el próximo viernes a las 10:00 AM. También te hemos enviado acceso a nuestra biblioteca de videos tutoriales y documentación. Revisa tu correo para los detalles de la reunión.",
      "category": "consultas"
    },
    {
      "id": 16,
      "title": "Problema con notificaciones por email",
      "description": "No estoy recibiendo las notificaciones por correo electrónico que configuré. He verificado que mi email está correcto y que las notificaciones están activadas en mi perfil.",
      "userId": 5,
      "assignedTo": null,
      "status": "pendiente",
      "priority": "media",
      "date": "2024-03-24T09:30:00Z",
      "updatedAt": "2024-03-24T09:30:00Z",
      "response": "",
      "category": "configuracion"
    },
    {
      "id": 17,
      "title": "Consulta sobre límites de API",
      "description": "Estoy desarrollando una integración y necesito saber cuál es el límite de requests por minuto para la API. También me gustaría saber si hay un plan con límites más altos.",
      "userId": 4,
      "assignedTo": 2,
      "status": "resuelto",
      "priority": "baja",
      "date": "2024-03-08T13:20:00Z",
      "updatedAt": "2024-03-08T15:00:00Z",
      "response": "El plan actual permite 100 requests por minuto. Si necesitas límites más altos, puedes considerar nuestro plan Enterprise que permite hasta 1000 requests por minuto. Te hemos enviado información detallada sobre los planes y precios a tu correo. Si tienes más preguntas, no dudes en contactarnos.",
      "category": "consultas"
    },
    {
      "id": 18,
      "title": "La página de dashboard carga muy lento",
      "description": "Desde hace una semana, el dashboard tarda más de 30 segundos en cargar completamente. Esto está afectando significativamente mi productividad. He probado en diferentes navegadores y conexiones.",
      "userId": 3,
      "assignedTo": 2,
      "status": "en_proceso",
      "priority": "alta",
      "date": "2024-03-21T10:45:00Z",
      "updatedAt": "2024-03-22T08:30:00Z",
      "response": "Estamos investigando el problema de rendimiento. Hemos identificado que algunos usuarios con grandes volúmenes de datos están experimentando este problema. Estamos optimizando las consultas y esperamos tener una solución en los próximos días. Te mantendremos informado del progreso.",
      "category": "tecnico"
    },
    {
      "title": "Ticket de prueba",
      "description": "Este es un ticket de prueba",
      "userId": 3,
      "status": "pendiente",
      "priority": "media",
      "date": "2024-03-25T10:00:00Z",
      "updatedAt": "2024-03-25T10:00:00Z",
      "response": "",
      "category": "consultas",
      "assignedTo": null,
      "id": 19
    }
  ]
}
